package boss

class BoRechargeTime {

    String branchCode;  //分公司编号
    String branchName;//分公司名称
    String  allowdate;   //允许日期
    String allowHour;  //允许小时
    String allowMits;  //允许分钟
    String dateCode;//标示。0：开始时间；1：结束时间
    int status;        //状态（0，启用；1，停用）

     static constraints = {

        branchCode(size: 1..25, nullable: true)
        branchName(size: 1..128, nullable: true)
        allowdate(size: 1..15, nullable: true)
        allowHour(size: 1..4, nullable: false)
        allowMits(size: 1..4, nullable: false)
        dateCode(size:1..10)
        status()
    }
    def static statusMap = ['0': '启用', '1': '停用']
    def static dateCodeMap = ['startTime': '开始时间', 'endTime': '结束时间']
    def static hourMap=['00':'00','01':'01','02':'02','03':'03','04':'04','05':'05','06':'06','07':'07','08':'08','09':'09','10':'10','11':'11','12':'12','13':'13','14':'14','15':'15','16':'16','17':'17','18':'18','19':'19','20':'20','21':'21','22':'22','23':'23','24':'24']
     def static minsMap=['00':'00','01':'01','02':'02','03':'03','04':'04','05':'05','06':'06','07':'07','08':'08','09':'09','10':'10','11':'11','12':'12','13':'13','14':'14','15':'15','16':'16','17':'17','18':'18','19':'19','20':'20','21':'21','22':'22','23':'23','24':'24','25':'25','26':'26','27':'27','28':'28','29':'29','30':'30','31':'31','32':'32','33':'33','34':'34','35':'35','36':'36','37':'37','38':'38','39':'39','40':'40','41':'41','42':'42','43':'43','44':'44','45':'45','46':'46','47':'47','48':'48','49':'49','50':'50','51':'51','52':'52','53':'53','54':'54','55':'55','56':'56','57':'57','58':'58','59':'59','60':'60']
}
